<?php

declare(strict_types=1);

namespace App\Dto;

class GeoPointSearchDto
{
    public const REPLACER = [
        'в. Кодцы Сенненскі раён' => 'в. Ходцы',
        'в. Бяланы Лагойскі раён' => 'в. Беланы',
        'Мікашы Мядзельскі раён' => 'Мікрашы',
        'Ісакавічы Лагойскі раён' => 'Сакавічы',
        'в. Махновічы Мазырскі раён' => 'в. Махнавічы',
        'Столбун Веткаўскі раён' => 'Стаўбун',
        'в.Аляхновічы Бярозаўскі раён' => 'в. Алёхнавічы',
        'в. Андрукі Бешанковіцкі раён' => 'в. Хізава', // Сустракаецца таксама варыянт Хі́зава, Андрукі́,
        'в. Лукьянава Сенненскі раён' => 'в. Лук’янава',
        'г/п Упла Бешанковіцкі раён' => 'аг. Ула',
        'в. Воласава Талачынскі раён' => 'в. Валосава',
        'Любічыцы Івацэвіцкі раён' => 'Любішчыцы',
        'в.Дзержынск Лельчыцкі раён' => 'в. Дзяржынск',
        'д.Новые Дятловичи Гомельскі раён' => 'в. Новые Дзятловічі',
        'д. Радостов Драгічынскі раён' => 'в. Радастава',
        'в. Беркава Акцябрскі раён' => 'Беркаў',
        'в. Баранцава Аршанскі раён' => 'в. Бранцава',
        'в. Цяленцьева Аршанскі раён' => 'в. Целянцеева',
        'в. Грыбашчына Ашмянскі раён' => 'в. Грыбаўшчына',
        'в. Жукраны Ашмянскі раён' => 'в. Жупраны',
        'в.Модаль Іванаўскі раён' => 'в. Моталь',
        'в. Адрыжычы Іванаўскі раён' => 'в. Адрыжын',
        'в. Бакунова Іўеўскі раён' => 'в. Бакунова 2',
        'в.Баранавічы Бабруйскі раён' => 'в. Баранавічы 1',
        'в. Татылавічы Бабруйскі раён' => 'в. Тажылавічы',
        'Долгій Клін Бабруйскі раён' => 'Доўгі Клін',
        'в. Кімея Барысаўскі раён' => 'в. Кімія',
        'в. Майсееўшчына Барысаўскі раён' => 'в. Маісееўшчына',
        'г. Жодіно Барысаўскі раён' => 'г. Жодзіна',
        'в. Ярцеўка Барысаўскі раён' => 'в. Ярцаўка',
        'в. Дубравы Бешанковіцкі раён' => 'в. Дуброва',
        'в. Вопса Браслаўскі раён' => 'в. Опса',
        'в. Кустань Брэсцкі раён' => 'в. Кустын',
        'в.Арэхаўка Полацкі раён' => 'Арэхаўна',
        'в.Катуженкі Полацкі раён' => 'Катушанкі',
        'г. Мсціслаўль Мсціслаўскі раён' => 'г. Мсціслаў',
        'в. Мяжыева Талачынскі раён' => 'Межыёва',
        'в. Кайшаўкі Карэліцкі раён' => 'в. Кайшоўка',
        'в. Амлынезы Нясвіжскі раён' => 'Амлынцы',
        'в. Беразкі Хоцімскі раён' => 'Бярозкі',
        'в. Юзефаўка Хоцімскі раён' => 'Юзяфоўка',
        'Галіцы Валожынскі раён' => 'Галімцы',
        'в. Старыя Елкі Брагінскі раён' => 'Старая Ёлча',
        'гарадскі пасёлак Стрешан Жлобінскі раён' => 'Стрэшын',
        'в. Затуя Нясвіжскі раён' => "Затур’я",
        "Затур'е Нясвіжскі раён" => "Затур’я",
        'в. Рублева-2 Лёзненскі раён' => 'в. Рублева',
        'в. Рублева-2' => 'в. Рублева',
        'в. Новалукомль' => 'г. Новалукомль',
        'Самасадаўка Крупскі раён' => 'в. Самаседаўка',
        'Дзялігі Мядзельскі раён' => 'в. Дзягілі',
        'Дзягелі Мядзельскі раён' => 'в. Дзягілі',
        'мяс. Багушэвічы Сенненскі раён' => 'Багушэўск',
        'Наліўцы Полацкі раён' => 'Наўліца',
        'Наліўкі Полацкі раён' => 'Наўліца',
        'Маргуны Докшыцкі раён' => 'Таргуны',
    ];

    public const DISTINCTS = [
        'Шаркоўшчынскі раён' => 'Шаркаўшчынскі раён',
        'Міёрскі раён' => 'Мёрскі раён',
        'Уздзенскі район' => 'Уздзенскі раён',
        'Ветрынскі раён' => 'Полацкі раён', // збольшага перайшоў у 1960 г.
        'Халопеніцкі раён' => 'Крупскі раён', // збольшага перайшоў у 1960 г.
        'Багушэўскі раён' => 'Сенненскі раён', // збольшага перайшоў у 1960 г.
    ];

    public const SUBDISTRICTS = [
        'Добромыслинский с/с' => 'Дабрамыслінскі с/с',
        'Крынковский с/с' => 'Крынкаўскі с/с',
        'Бабиновичский с/с' => 'Бабінавіцкі с/с',
        'Задровьевский с/с' => 'Задроўеўскі с/с',
    ];

    public const PREFIXES = [
        'г.п.' => 'гп.',
        'г. п.' => 'гп.',
        'г/п' => 'гп.',
        'гп ' => 'гп. ',
        'с.' => 'в.',
        'д.' => 'в.',
    ];

    public const AUTHOR_PLACE = [
        'вакальная група калгаса "Маяк камунізму" Лунінецкі раён' => 'Кажан-Гарадок',
    ];

    public const REPLACE_DISTRICT = [
        'в. Гольцы (зараз Пінскі раён) Столінскі раён' => 'Пінскі раён',
        'в. Гольцы (сёння - Пінскі раён) Столінскі раён' => 'Пінскі раён',
        'в. Гольцы (сёння Пінскі раён) Столінскі раён' => 'Пінскі раён',
        'в. Гольцы (цяпер Пінскі раён) Столінскі раён' => 'Пінскі раён',
        'в. Градно Барысаўскі раён' => 'Чэрвеньскі раён',
        'Барань Крупскі раён' => 'Барысаўскі раён',
    ];

    public const LOCATIONS_SKIP = [
        'б/а Дружба Запісы без указання раёна Мінскай вобласці',
        'с./т. “Ель” Маладзечанскі раён',
        'п/а Заходняя МВС Мінскі раён',
    ];

    /**
     * @var array<string>
     */
    public array $names = [];

    /**
     * @var array<string>
     */
    public array $prefixes = [];

    public ?string $region = null;

    public ?string $district = null;

    public ?string $subDistrict = null;

    public ?int $limit = null;
}
