<?php

declare(strict_types=1);

namespace App\Entity\Type;

class GenderType
{
    public const UNKNOWN = 0;
    public const MALE = 1;
    public const FEMALE = 2;

    public const TYPES = [
        self::UNKNOWN => '?',
        self::MALE => 'м',
        self::FEMALE => 'ж',
    ];

    public const TYPES_MIDDLE = [
        self::UNKNOWN => '?',
        self::MALE => 'муж',
        self::FEMALE => 'жан',
    ];

    public const MIDDLE_3_LAST_FEMALE = ['ўна', 'вна', 'чна'];
    public const LAST_3_LAST_FEMALE = ['ёва', 'ова', 'ева', 'іна', 'ава', 'ына'];
    public const LAST_3_LAST_MALE = ['скі', 'коў', 'хаў'];
    public const LAST_4_LAST_FEMALE = ['ская', 'цкая'];

    public const REPLACE_NAMES = [
        'Алла' => 'Ала',
        'Любовь' => 'Любоў',
        'Іріна' => 'Ірына',
        'Ніколеўна' => 'Мікалаеўна',
        'Ніколаеўна' => 'Мікалаеўна',
        'Васілій' => 'Васіль',
        'Нікітовіч' => 'Мікітавіч',
        'Нікіта' => 'Мікіта',
        'Ніколай' => 'Мікалай',
        'Ніколаевіч' => 'Мікалаевіч',
        'Евгенія' => 'Яўгенія',
        'Інна' => 'Іна',
        'Маріна' => 'Марына',
        'Жанна' => 'Жана',
        'Эмма' => 'Эма',
        'Сьцяпан' => 'Сцяпан',
        'Сергей' => 'Сяргей',
        'Сергеевіч' => 'Сяргеевіч',
        'Стефан' => 'Стэфан',
        'Мар\'і' => 'Мар\'я',
        'Алесі' => 'Алеся',
    ];

    public const FEMALE_NAMES = [
        'Агапія' => ['Агата', 'Гана'],
        'Агрыпіна' => ['Грыпіна', 'Агруся', 'Груня', 'Рыпіна'],
        'Адэлаіда' => ['Адэля', 'Адзька', 'Адэлька', 'Адэльця'],
        'Акуліна' => ['Куліна', 'Акуліта'],
        'Ала' => [],
        'Алена' => ['Лена', 'Алёна', 'Ялена', 'Аліся'],
        'Аліна' => [],
        'Аліса' => [],
        'Аляксандра' => ['Александрына', 'Алеся'],
        'Анастасія' => ['Наста', 'Наська', 'Настка', 'Настуся', 'Настасся', 'Настачка'],
        'Ангеліна' => ['Ангеля', 'Гэля'],
        'Анжаліка' => ['Ліка'],
        'Анжэла' => [],
        'Антаніна' => ['Антоля'],
        'Антонія' => ['Антося'],
        'Аўдоцця' => ['Аўдоля', 'Аўдзюха', 'Аўдзюня', 'Дзюня', 'Аўдзютка', 'Дзютка', 'Аўдося', 'Дося'],
        'Барбара' => [],
        'Браніслава' => ['Броня', 'Бронька'],
        'Будзіслава' => ['Будзя'],
        'Бэла' => ['Бэлка'],
        'Валерыя' => ['Лера', 'Валюся', 'Люська'],
        'Валянціна' => ['Валя', 'Валена', 'Валюша', 'Валюня', 'Ціна'],
        'Ванда' => ['Вана', 'Вандзя', 'Вандачка'],
        'Варвара' => ['Вара', 'Варця', 'Варка', 'Варуся', 'Барбара', 'Барця', 'Барціся'],
        'Вера' => ['Верця', 'Верка', 'Вяруня', 'Вяруся'],
        'Вераніка' => ['Веранічка'],
        'Вікторыя' => ['Віка', 'Вічка', 'Вікуля', 'Вікта', 'Вікця', 'Віктуся'],
        'Віталіна' => ['Віталінка', 'Таліна', 'Талінка'],
        'Віялета' => ['Віта', 'Вітуля', 'Вітуся', 'Лета', 'Вія'],
        'Вольга' => ['Вольця', 'Волька', 'Вальжына'],
        'Вянера' => ['Вянерка', 'Нера'],
        'Вячаслава' => [],
        'Галіна' => ['Галя', 'Галька', 'Галінка', 'Галюся', 'Галюня'],
        'Ганарата' => [],
        'Ганна' => ['Ганка', 'Ганця', 'Гануся', 'Гануля', 'Ганнушка', 'Анюта', 'Анна', 'Анка', 'Анюша', 'Анушка', 'Анюра', 'Нюра', 'Нюрка', 'Нюта', 'Нюша', 'Нюця'],
        'Дамініка' => ['Дамінічка', 'Даміся'],
        'Дар\'я' => ['Адарка', 'Адар\'я', 'Дарота', 'Дарка'],
        'Дарафея' => ['Дара', 'Фея', 'Дарфейка'],
        'Ева' => ['Еўця', 'Еўка', 'Яўціся'],
        'Еўдакія' => ['Аўдзіся', 'Аўдотка', 'Аўдольця', 'Дануся'],
        'Ефрасіння' => ['Прося'],
        'Жана' => ['Ануся'],
        'Зінаіда' => ['Зіна'],
        'Зося' => ['Зоя'],
        'Ірына' => ['Арына', 'Арыша', 'Арышка'],
        'Іна' => [],
        'Ірэна' => [],
        'Караліна' => ['Каруся', 'Карута'],
        'Кацярына' => ['Кася', 'Каця'],
        'Крысціна' => ['Хрысціна', 'Крысця', 'Крыстуся', 'Крыста'],
        'Ксенія' => ['Аксюта', 'Аксёна', 'Аксініца'],
        'Ларыса' => ['Лара', 'Лора', 'Ларуся', 'Ларуська'],
        'Лідзія' => ['Лідка', 'Лідуся', 'Ліда'],
        'Лізавета' => ['Лісавета', 'Ліза'],
        'Лілія' => ['Ліля', 'Лілюня', 'Лілюся', 'Лілюша', 'Лілёк', 'Лілюльчык'],
        'Любава' => ['Любаша', 'Любавачка'],
        'Любаміра' => ['Міра'],
        'Любоў' => ['Люба', 'Любіна'],
        'Людміла' => ['Люда', 'Людка', 'Людуся', 'Люся', 'Міля', 'Мілаша', 'Мілка', 'Мілуся'],
        'Люцыя' => ['Лія', 'Люца', 'Люцылія'],
        'Магдалена' => ['Магда', 'Магдзя', 'Магдзіся'],
        'Маргарыта' => ['Маргуся', 'Магарэта', 'Магарэся', 'Магурэта'],
        'Марта' => [],
        'Марына' => ['Марыня'],
        'Марыя' => ['Маня', 'Манька', 'Марыля', 'Маруся', 'Марка', 'Мар\'яна', 'Мар\'я', 'Мара', 'Марця', 'Марыся'],
        'Надзея' => ['Надзя', 'Надзька', 'Надзі'],
        'Наталля' => ['Наталка', 'Наталька', 'Натася', 'Наталя', 'Наташа'],
        'Ніна' => ['Нінка', 'Нінуся'],
        'Паліна' => ['Палінка', 'Полька', 'Польця', 'Палюся'],
        'Раіса' => ['Рая', 'Раечка', 'Раіска'],
        'Рэгіна' => ['Рася', 'Раська', 'Раіна'],
        'Святлана' => ['Света', 'Святланка', 'Ланка'],
        'Соф\'я' => ['Зоська', 'Зося', 'Сонька', 'Соня', 'Софа', 'Зафія', 'Сафія'],
        'Сцепаніда' => ['Стэпка', 'Сцепка', 'Стэфанія'],
        'Таісія' => ['Таіса', 'Тая', 'Тася', 'Таюня', 'Таюта', 'Таечка'],
        'Тамара' => ['Тома', 'Тамарка', 'Тамуся'],
        'Таццяна' => ['Таня', 'Тацянка', 'Тацяна', 'Танюся', 'Тата', 'Татка', 'Туся', 'Таша'],
        'Уладзіслава' => [],
        'Ульяна' => ['Улляна', 'Уляна', 'Улянка', 'Уля'],
        'Фёкла' => ['Тэкля'],
        'Фіала' => ['Філя', 'Філька'],
        'Хадора' => [],
        'Хвядора' => [],
        'Хрысціна' => ['Хрыста'],
        'Хрысціяна' => ['Хрысця', 'Хрыся'],
        'Часлава' => ['Чэся'],
        'Эліна' => ['Элінка'],
        'Эльвіра' => ['Эла', 'Эльвірка', 'Элюня', 'Элюся', 'Элюша', 'Віра'],
        'Эма' => ['Эмка', 'Эмуня', 'Муня'],
        'Эмілія' => ['Аміля', 'Эма', 'Мэля', 'Мільцэся'],
        'Юзэфа' => ['Юзюня', 'Юзя'],
        'Юлія' => ['Юля', 'Юлька', 'Юльця', 'Юляся', 'Юльяна'],
        'Ядзвіга' => ['Ядзвіся', 'Ядзя'],
        'Яна' => ['Яніка', 'Януся', 'Янушка', 'Янічка'],
        'Яўгенія' => ['Югася', 'Геньця', 'Аўгуся', 'Аўгіння', 'Аўгіня', 'Геня'],
        'Яніна' => [],
    ];

    public const MALE_NAMES = [
        'Адам' => ['Адась'],
        'Акім' => ['Якім', 'Юктук', 'Юхім', 'Юхша'],
        'Алег' => ['Алік', 'Лёка', 'Алежка'],
        'Аляксандр' => ['Алесь', 'Ольцік', 'Вольцік', 'Вольша', 'Алех', 'Алехна'],
        'Аляксей' => ['Алёкса', 'Лёкса', 'Лёша', 'Леша', 'Ляксей'],
        'Анатоль' => ['Толя', 'Толік'],
        'Андрэй' => ['Яндрэй', 'Андруш', 'Андрук', 'Андрусь'],
        'Анісім' => ['Анісік', 'Аніська', 'Аніс'],
        'Антон' => ['Антоні', 'Антось', 'Антук'],
        'Ануфрый' => [],
        'Аркадзь' => ['Аркадзя', 'Аркал'],
        'Арнольд' => [],
        'Арсеній' => ['Арсень', 'Арсен', 'Сеня', 'Арсік', 'Арсук', 'Арсім', 'Арсайла', 'Арцісь', 'Арцім', 'Арціш'],
        'Артур' => ['Артусь', 'Артук'],
        'Арцём' => ['Арцюх'],
        'Астап' => ['Астапук', 'Астапка', 'Астах', 'Асташ'],
        'Афанасій' => ['Апанас', 'Панас', 'Апанась', 'Панась'],
        'Багдан' => ['Богдан', 'Данчык', 'Бонік', 'Боня', 'Богусь'],
        'Багуслаў' => ['Багусь', 'Богцік', 'Багук', 'Богша'],
        'Базыль' => [],
        'Баляслаў' => ['Болесь', 'Булесь'],
        'Баніфацый' => ['Баніфат', 'Баніхват', 'Баніфацыйка', 'Баня', 'Банюсь', 'Фаця', 'Ніхват', 'Баніфацы', 'Боніс'],
        'Барыс' => ['Бора', 'Борусь'],
        'Барыслаў' => [],
        'Браніслаў' => ['Бронісь', 'Бранюк', 'Броняк'],
        'Брачыслаў' => ['Брача'],
        'Будзімір' => ['Дзіма', 'Мірык'],
        'Будзіслаў' => [],
        'Вадзім' => ['Вадзік'],
        'Валерый' => ['Валер'],
        'Валянцін' => ['Волесь'],
        'Варфаламей' => ['Барталамей', 'Бахрамей', 'Бартош', 'Баўтрук', 'Будрыс'],
        'Васіль' => ['Васілька', 'Вася', 'Васька', 'Базыль', 'Базылька'],
        'Венядзікт' => ['Бенядзікт', 'Банадысь'],
        'Вікенцій' => [],
        'Віктар' => ['Вікцік', 'Віктук', 'Віктусь'],
        'Вінцэнт' => ['Вінцук', 'Вінцусь', 'Вінька'],
        'Віталій' => ['Віталь', 'Віталя'],
        'Вітаўт' => ['Вітусь', 'Вітак'],
        'Вітольд' => [],
        'Вячаслаў' => ['Вячка', 'Вячык', 'Слава', 'Слаўка'],
        'Ганарат' => [],
        'Гарыслаў' => [],
        'Гаўрыла' => ['Гаўрусь', 'Гаўрык', 'Гаўрук', 'Гаўра', 'Габрук', 'Габрысь'],
        'Генадзь' => ['Генік', 'Генусь', 'Гена'],
        'Георгій' => ['Юрык', 'Ярык', 'Юрыла', 'Ярыла', 'Юрага', 'Алігор', 'Жора'],
        'Герасім' => ['Герась', 'Гарась', 'Гараська', 'Гараска', 'Гарасюк', 'Гарасім', 'Грасім', 'Гарасік'],
        'Глеб' => ['Глебка', 'Глебік'],
        'Давыд' => ['Давід', 'Давідчык', 'Давідзюк', 'Давыдзік', 'Додзя', 'Додзік', 'Давыдзька'],
        'Дамінік' => ['Домка', 'Дамінічак'],
        'Даніла' => ['Данік', 'Данусь', 'Дольцік', 'Данель', 'Дануль', 'Данук', 'Дануйла'],
        'Дарафей' => ['Дорах', 'Дораш', 'Дарошка', 'Дарапей', 'Дарафейчык', 'Дарук', 'Дарацей', 'Дарцісь'],
        'Дзмітрый' => ['Зміцер', 'Змітрок', 'Змітра', 'Змітро', 'Змітрук'],
        'Дзяніс' => ['Дзяніска'],
        'Емяльян' => ['Амяльян', 'Амелька'],
        'Еўдакім' => ['Аўдось', 'Аўдзік', 'Аўдук', 'Аўдот', 'Аўдыяш'],
        'Ждан' => ['Жданко', 'Даня'],
        'Захар' => ['Захара', 'Захар\'я'],
        'Зосім' => [],
        'Іван' => ['Івась', 'Івашка', 'Ясюк', 'Яська', 'Якцік', 'Януш'],
        'Ігар' => ['Ігарок'],
        'Ігнат' => ['Ігнась', 'Ігнатка'],
        'Іларыён' => [],
        'Ілля' => ['Іляш', 'Ільяш', 'Іллюк', 'Ільюк', 'Ілья', 'Галляш', 'Гальяш'],
        'Іон' => [],
        'Іосіф' => ['Язэп', 'Юзік', 'Юзок', 'Еська', 'Юзуль', 'Ёзэф', 'Юзаф'],
        'Казімір' => ['Казік', 'Казюк'],
        'Калістрат' => [],
        'Кандрат' => ['Кандрась', 'Кандраш'],
        'Канстанцін' => ['Кастусь', 'Косцік', 'Косць', 'Касташ', 'Канстант', 'Канстайла'],
        'Карл' => ['Карусь', 'Карук', 'Корша'],
        'Кірыл' => ['Кірыла', 'Кірык', 'Кірук', 'Кір\'ян', 'Чурыла'],
        'Кузьма' => ['Кузік', 'Кузмісь'],
        'Лаўрэнцій' => ['Лаўрук', 'Лаўрык', 'Лаўрусь', 'Лаўрын', 'Лаўрыш', 'Лявон'],
        'Леанід' => ['Лянько', 'Лёнік'],
        'Лука' => [],
        'Лявон' => [],
        'Максім' => ['Максімка', 'Максюта', 'Мася'],
        'Мацвей' => ['Мацей', 'Матук', 'Мацісь', 'Матыс', 'Матыяш'],
        'Мікалай' => ['Мікола', 'Міколка', 'Міколя'],
        'Мікіта' => ['Міцька'],
        'Мірон' => ['Мірцік', 'Мірук', 'Мірась', 'Міраш'],
        'Міхаіл' => ['Міхась', 'Міхал', 'Міхалка', 'Міхайла'],
        'Мяфодзій' => [],
        'Навум' => [],
        'Несцер' => [],
        'Нікіфар' => ['Нічыпар'],
        'Павел' => ['Павал', 'Паўлюк', 'Паўка', 'Пашка', 'Павель'],
        'Патап' => [],
        'Пётр' => ['Пятрусь', 'Петрык', 'Пятрук', 'Пятро', 'Пятраш'],
        'Піліп' => ['Філіп', 'Філ', 'Піліпка', 'Хвіліп'],
        'Пракофій' => ['Пракоп', 'Пракопка', 'Прокша'],
        'Радзівон' => ['Радзісь', 'Радзік', 'Радзька', 'Радзюк'],
        'Раман' => ['Рамаш', 'Ромцік', 'Рамук', 'Рамась', 'Ромусь'],
        'Рыгор' => ['Рыгорка', 'Рыгось', 'Грышка', 'Грыша'],
        'Сава' => [],
        'Святаслаў' => ['Свят'],
        'Станіслаў' => ['Стась', 'Стасік', 'Стасюк', 'Станіш'],
        'Сцяпан' => ['Сцёпка', 'Стэфан'],
        'Сымон' => ['Сымюк'],
        'Сямён' => ['Сёмка', 'Сёма'],
        'Сяргей' => ['Сярожа', 'Сяржук', 'Серж'],
        'Тарас' => ['Тарасік', 'Тарасюк', 'Тарасок'],
        'Трафім' => ['Трахім', 'Атрох'],
        'Уладзімір' => ['Валодзік', 'Валодзька', 'Валодзя', 'Валодусь', 'Валадар', 'Валодша', 'Ладзік', 'Уладзік', 'Уладамір', 'Ладамір', 'Ладша'],
        'Уладзіслаў' => ['Уладук', 'Ладук', 'Уладыслаў', 'Уладзь'],
        'Тэадор' => ['Фёдар', 'Тодар', 'Ходка', 'Хведар', 'Хадась', 'Хадаш', 'Тодзік', 'Хвядук', 'Хвядос'],
        'Усцін' => [],
        'Фадзей' => [],
        'Феадосій' => ['Фядос'],
        'Фэлікс' => [],
        'Філімон' => [],
        'Франц' => [],
        'Францыск' => ['Францішак', 'Францішка', 'Пронцік', 'Пранцісь', 'Франак', 'Фронусь'],
        'Харлам' => ['Харлан', 'Харламка', 'Харланя'],
        'Хрысціян' => ['Хрысцік', 'Хрысцюк'],
        'Цімафей' => ['Цімук', 'Цімка', 'Цімусь'],
        'Ціхан' => ['Цішка', 'Ціхон'],
        'Часлаў' => ['Чэсь'],
        'Эдуард' => ['Эдвард', 'Адуард', 'Эдзісь', 'Эдзя', 'Эдзюк', 'Эдзька'],
        'Юлій' => ['Юлісь'],
        'Юрый' => ['Юрась', 'Юрок', 'Юрка', 'Юры', 'Юра', 'Юхно'],
        'Ягор' => ['Ягорка', 'Горык', 'Гарык'],
        'Якаў' => ['Якуб', 'Янцік', 'Яктук', 'Яктусь'],
        'Ян' => ['Янка', 'Янук', 'Ясь'],
        'Яўген' => ['Аўген', 'Аўгук', 'Аўгусь', 'Аўгей', 'Аўгіяш', 'Геньцік', 'Генісь', 'Генюш'],
        'Яфім' => ['Яўхім', 'Яхімка'],
    ];

    public const FEMALE_OTHERS = ['Ніка', 'Ліна', 'Анэта', 'Анця', 'Рэня', 'Міла', 'Эля'];
    public const MALE_OTHERS = ['Богуш', 'Будзя', 'Валік', 'Ладысь', 'Уладысь'];
    public const ANY_OTHERS = ['Валерка'];

    public const MIDDLE_NAMES = [
        'Адамавіч' => [],
        'Акімавіч' => [],
        'Алегавіч' => [],
        'Аляксандравіч' => [],
        'Аляксеевіч' => ['Аляксеявіч'],
        'Анатольевіч' => [],
        'Андрэевіч' => ['Андреевіч'],
        'Анісімавіч' => [],
        'Антонавіч' => [],
        'Ануфрыевіч' => [],
        'Аркадзьевіч' => [],
        'Арнольдавіч' => [],
        'Арсеньевіч' => [],
        'Артуравіч' => [],
        'Арцёмавіч' => [],
        'Астапавіч' => [],
        'Афанасьевіч' => [],
        'Багданавіч' => [],
        'Багуслававіч' => [],
        'Базыльевіч' => [],
        'Баляслававіч' => [],
        'Баніфацьевіч' => [],
        'Барысавіч' => [],
        'Барыслававіч' => [],
        'Браніслававіч' => [],
        'Брачыслававіч' => [],
        'Будзіміравіч' => [],
        'Будзіслававіч' => [],
        'Вадзімавіч' => [],
        'Валерьевіч' => [],
        'Валянцінавіч' => [],
        'Варфаламей' => [],
        'Васільевіч' => ['Васілевіч'],
        'Венедзіктавіч' => [],
        'Вікеньцевіч' => ['Вікенцевіч', 'Вікентавіч'],
        'Віктаравіч' => [],
        'Вінцэнтавіч' => [],
        'Вітальевіч' => [],
        'Вітаўтавіч' => [],
        'Вітольдавіч' => [],
        'Вячаслававіч' => [],
        'Гарыслававіч' => [],
        'Гаўрылавіч' => [],
        'Ганаратавіч' => [],
        'Генадзьевіч' => [],
        'Георгіевіч' => [],
        'Герасімавіч' => [],
        'Глебавіч' => [],
        'Давыдавіч' => [],
        'Дамінікавіч' => [],
        'Данілавіч' => [],
        'Дарафеевіч' => [],
        'Дзмітрыевіч' => ['Дзмітравіч', 'Дзмітравіч'],
        'Дзянісавіч' => [],
        'Емяльянавіч' => ['Амяльянавіч'],
        'Еўдакімавіч' => [],
        'Жданавіч' => [],
        'Захаравіч' => [],
        'Засімовіч' => [],
        'Іванавіч' => ['Івановіч'],
        'Ігарьевіч' => ['Ігарок'],
        'Ігнацьевіч' => [],
        'Іларыяновіч' => ['Іларыонавіч'],
        'Ільіч' => [],
        'Іонавіч' => [],
        'Іосіфавіч' => [],
        'Калістратавіч' => [],
        'Казіміравіч' => [],
        'Кандрацьевіч' => [],
        'Канстанцінавіч' => [],
        'Карлавіч' => [],
        'Кірылавіч' => [],
        'Кузьміч' => ['Кузьмініч'],
        'Лаўрэнцьевіч' => [],
        'Леанідавіч' => [],
        'Лукіч' => [],
        'Лявонавіч' => [],
        'Максімавіч' => [],
        'Мацвеевіч' => [],
        'Мікалаевіч' => [],
        'Мікітавіч' => [],
        'Міронавіч' => [],
        'Міхайлавіч' => [],
        'Мяфодзьевіч' => [],
        'Навумовіч' => [],
        'Несцеравіч' => [],
        'Нікіфаравіч' => [],
        'Паўлавіч' => [],
        'Патапавіч' => [],
        'Піліпавіч' => ['Філіпавіч'],
        'Пятровіч' => [],
        'Пракопавіч' => [],
        'Радзівонавіч' => [],
        'Раманавіч' => [],
        'Рыгоравіч' => ['Рыгорьевіч'],
        'Савіч' => [],
        'Святаслававіч' => [],
        'Станіслававіч' => [],
        'Сцяпанавіч' => ['Сьцяпанавіч', 'Стэфанавіч'],
        'Сымонавіч' => [],
        'Сямёнавіч' => [],
        'Сяргеевіч' => ['Сергеевіч'],
        'Тарасавіч' => [],
        'Трафімавіч' => [],
        'Уладзіміравіч' => [],
        'Уладзіслававіч' => [],
        'Усцінавіч' => [],
        'Фадзеевіч' => [],
        'Фёдаравіч' => ['Тэадоравіч', 'Федаравіч'],
        'Фэліксавіч' => [],
        'Філімонавіч' => [],
        'Францавіч' => [],
        'Францыскавіч' => [],
        'Фядосавіч' => [],
        'Харламавіч' => [],
        'Хрысціянавіч' => [],
        'Цімафеевіч' => [],
        'Ціханавіч' => [],
        'Часлававіч' => [],
        'Эдуардавіч' => [],
        'Юльевіч' => [],
        'Юрьевіч' => [],
        'Ягоравіч' => [],
        'Якаўлевіч' => [],
        'Янавіч' => [],
        'Яўгенавіч' => [],
        'Яфімавіч' => [],
    ];

    public static function getType(?string $type): int
    {
        $key = array_search($type, self::TYPES, true);

        return $key !== false ? $key : self::UNKNOWN;
    }

    public static function getNotUniqueNames(): array
    {
        $result = [];

        $allNamesFemale = [];
        foreach (self::FEMALE_NAMES as $name => $others) {
            foreach ($others as $other) {
                if (isset($allNamesFemale[$other])) {
                    $result['FEMALE_' . $other] = [$allNamesFemale[$other], $name];
                }
                $allNamesFemale[$other] = $name;
            }
        }

        $allNamesMale = [];
        foreach (self::MALE_NAMES as $name => $others) {
            foreach ($others as $other) {
                if (isset($allNamesMale[$other])) {
                    $result['MALE_' . $other] = [$allNamesMale[$other], $name];
                }
                $allNamesMale[$other] = $name;
            }
        }

        foreach ($allNamesMale as $name => $male) {
            if (isset($allNamesFemale[$name])) {
                $result[$name] = [$allNamesFemale[$name], $male];
            }
        }

        return $result;
    }

    public static function getGender(string $name): int
    {
        if (in_array($name, self::FEMALE_OTHERS, true)) {
            return self::FEMALE;
        }
        if (in_array($name, self::MALE_OTHERS, true)) {
            return self::MALE;
        }

        foreach (self::FEMALE_NAMES as $female_name => $others) {
            if ($name === $female_name) {
                return self::FEMALE;
            }
            foreach ($others as $other) {
                if ($other === $name) {
                    return self::FEMALE;
                }
            }
        }

        foreach (self::MALE_NAMES as $male_name => $others) {
            if ($name === $male_name) {
                return self::MALE;
            }
            foreach ($others as $other) {
                if ($other === $name) {
                    return self::MALE;
                }
            }
        }

        return self::UNKNOWN;
    }

    public static function isBaseName(string $name): bool
    {
        return isset(self::FEMALE_NAMES[$name]) || isset(self::MALE_NAMES[$name]);
    }

    public static function isMaybeMaleMiddle(string $name): bool
    {
        $right3 = mb_substr($name, -3);

        return $right3 === 'віч';
    }

    public static function isMaleMiddle(string $name): bool
    {
        if (isset(self::MIDDLE_NAMES[$name])) {
            return true;
        }

        foreach (self::MIDDLE_NAMES as $others) {
            if (in_array($name, $others, true)) {
                return true;
            }
        }

        return false;
    }

    public static function isShortMiddle(string $name): bool
    {
        $last = mb_substr($name, -1);
        if ($last !== '.' && mb_strlen($name) > 3) {
            return false;
        }

        $part = mb_substr($name, 0, -1);
        $length = mb_strlen($part);

        foreach (self::MIDDLE_NAMES as $middle => $others) {
            if ($part === mb_substr($middle, 0, $length) && mb_strlen($middle) > $length) {
                return true;
            }

            foreach ($others as $other) {
                if ($part === mb_substr($other, 0, $length) && mb_strlen($middle) > $length) {
                    return true;
                }
            }
        }

        return false;
    }
}
